#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.yandex_resourcemanager_folder.default: Reading...
data.yandex_function.scrapper: Reading...
yandex_iam_service_account.function_invoker: Refreshing state... [id=ajectibtlg0ko7qktkef]
data.yandex_resourcemanager_folder.default: Read complete after 1s [id=b1gg9v30c1mpfe9msdcu]
yandex_resourcemanager_folder_iam_binding.function_invoker_role: Refreshing state... [id=b1gg9v30c1mpfe9msdcu/serverless.functions.invoker]
data.yandex_function.scrapper: Read complete after 1s [id=d4ef3fel1s14vja0fn3k]
yandex_function_trigger.timer: Refreshing state... [id=a1s7e6lva6m449q1rvn4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # yandex_function_trigger.timer must be replaced
-/+ resource "yandex_function_trigger" "timer" {
      ~ created_at  = "2022-09-21T18:37:21Z" -> (known after apply)
      ~ folder_id   = "b1gg9v30c1mpfe9msdcu" -> (known after apply)
      ~ id          = "a1s7e6lva6m449q1rvn4" -> (known after apply)
      - labels      = {} -> null
        name        = "accommodation-invoker"
        # (1 unchanged attribute hidden)

      ~ function {
            id                 = "d4ef3fel1s14vja0fn3k"
            # (2 unchanged attributes hidden)
        }

      - timeouts {}

      ~ timer {
          ~ cron_expression = "0 * ? * * *" -> "*/30 * ? * * *" # forces replacement
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @y-popov, Action: `pull_request`*